Convert docs diagrams to Mermaid
Signed-off-by: Brad Smith <brad.alan.smith@gmail.com>
